<?xml version="1.0" ?>
<net name="license-plate-recognition-barrier-0007" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 3, 24, 94"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input/scale_copy" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="64, 3, 3, 3" size="6912"/>
			<output>
				<port id="0" names="Conv/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_3331" type="Const" version="opset1">
			<data element_type="f32" offset="6912" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="MaxPool2D/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1" names="MaxPool2D/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Conv_1/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="7168" shape="32, 64, 1, 1" size="8192"/>
			<output>
				<port id="0" names="Conv_1/weights/read:0" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_add_33343339" type="Const" version="opset1">
			<data element_type="f32" offset="15360" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_1/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_1/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Conv_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_1/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_2/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="15488" shape="32, 32, 3, 1" size="12288"/>
			<output>
				<port id="0" names="Conv_2/weights/read:0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_33423347" type="Const" version="opset1">
			<data element_type="f32" offset="27776" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_2/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_2/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_2/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_3/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="27904" shape="32, 32, 1, 3" size="12288"/>
			<output>
				<port id="0" names="Conv_3/weights/read:0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_33503355" type="Const" version="opset1">
			<data element_type="f32" offset="40192" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Conv_3/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_3/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_4/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="40320" shape="128, 32, 1, 1" size="16384"/>
			<output>
				<port id="0" names="Conv_4/weights/read:0" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_33583363" type="Const" version="opset1">
			<data element_type="f32" offset="56704" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_4/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_4/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_4/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="MaxPool2D_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>22</dim>
					<dim>92</dim>
				</port>
			</input>
			<output>
				<port id="1" names="MaxPool2D_1/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_5/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="57216" shape="64, 128, 1, 1" size="32768"/>
			<output>
				<port id="0" names="Conv_5/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data_add_33663371" type="Const" version="opset1">
			<data element_type="f32" offset="89984" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_5/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_5/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_5/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_6/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="90240" shape="64, 64, 3, 1" size="49152"/>
			<output>
				<port id="0" names="Conv_6/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_33743379" type="Const" version="opset1">
			<data element_type="f32" offset="139392" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_6/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_6/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_6/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_7/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="139648" shape="64, 64, 1, 3" size="49152"/>
			<output>
				<port id="0" names="Conv_7/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_7/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_33823387" type="Const" version="opset1">
			<data element_type="f32" offset="188800" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_7/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_7/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Conv_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_7/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_8/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="189056" shape="256, 64, 1, 1" size="65536"/>
			<output>
				<port id="0" names="Conv_8/weights/read:0" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_8/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="data_add_33903395" type="Const" version="opset1">
			<data element_type="f32" offset="254592" shape="1, 256, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_8/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_8/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_8/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_8/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_9/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="255616" shape="64, 256, 1, 1" size="65536"/>
			<output>
				<port id="0" names="Conv_9/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_9/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="data_add_33983403" type="Const" version="opset1">
			<data element_type="f32" offset="321152" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_9/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_9/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_9/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_9/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_10/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="321408" shape="64, 64, 3, 1" size="49152"/>
			<output>
				<port id="0" names="Conv_10/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_10/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="data_add_34063411" type="Const" version="opset1">
			<data element_type="f32" offset="370560" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_10/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_10/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_10/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_10/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_11/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="370816" shape="64, 64, 1, 3" size="49152"/>
			<output>
				<port id="0" names="Conv_11/weights/read:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_11/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_add_34143419" type="Const" version="opset1">
			<data element_type="f32" offset="419968" shape="1, 64, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_11/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_11/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_11/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_11/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_12/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="420224" shape="256, 64, 1, 1" size="65536"/>
			<output>
				<port id="0" names="Conv_12/weights/read:0" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_12/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_34223427" type="Const" version="opset1">
			<data element_type="f32" offset="485760" shape="1, 256, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_12/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_12/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Conv_12/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_12/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MaxPool2D_2/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3, 3" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>10</dim>
					<dim>90</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Dropout/Identity:0,MaxPool2D_2/MaxPool:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_13/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="486784" shape="256, 256, 4, 1" size="1048576"/>
			<output>
				<port id="0" names="Conv_13/weights/read:0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_13/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="data_add_34303435" type="Const" version="opset1">
			<data element_type="f32" offset="1535360" shape="1, 256, 1, 1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_13/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_13/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_13/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Conv_13/Relu:0,Dropout_1/Identity:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_14/BatchNorm/FusedBatchNorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1536384" shape="71, 256, 1, 13" size="945152"/>
			<output>
				<port id="0" names="Conv_14/weights/read:0" precision="FP32">
					<dim>71</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_14/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 6" pads_end="0, 6" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>71</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="data_add_34383443" type="Const" version="opset1">
			<data element_type="f32" offset="2481536" shape="1, 71, 1, 1" size="284"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_14/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_14/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_14/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_14/Relu/Transpose/value42876235" type="Const" version="opset1">
			<data element_type="i64" offset="2481820" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_14/Relu/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_14/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>88</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Flatten/flatten/Reshape/shape252" type="Const" version="opset1">
			<data element_type="i64" offset="2481852" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Flatten/flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>88</dim>
					<dim>71</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Flatten/flatten/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>6248</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="fully_connected/weights/read" type="Const" version="opset1">
			<data element_type="f32" offset="2481868" shape="128, 6248" size="3198976"/>
			<output>
				<port id="0" names="fully_connected/weights/read:0" precision="FP32">
					<dim>128</dim>
					<dim>6248</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="fully_connected/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6248</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>6248</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fully_connected/MatMul:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="fully_connected/BatchNorm/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" offset="5680844" shape="4" size="32"/>
			<output>
				<port id="0" names="fully_connected/BatchNorm/Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="fully_connected/BatchNorm/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="fully_connected/BatchNorm/Reshape/Transpose/value42996247" type="Const" version="opset1">
			<data element_type="i64" offset="5680876" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="fully_connected/BatchNorm/Reshape/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fully_connected/BatchNorm/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="data_mul_34453449" type="Const" version="opset1">
			<data element_type="f32" offset="5680908" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="fully_connected/BatchNorm/FusedBatchNorm/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="data_add_34463451" type="Const" version="opset1">
			<data element_type="f32" offset="5681420" shape="1, 128, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="fully_connected/BatchNorm/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="fully_connected/BatchNorm/FusedBatchNorm/variance/Fused_Add_/Transpose/value42916322" type="Const" version="opset1">
			<data element_type="i64" offset="2481820" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="fully_connected/BatchNorm/FusedBatchNorm/variance/Fused_Add_/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fully_connected/BatchNorm/FusedBatchNorm:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="fully_connected/BatchNorm/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="fully_connected/BatchNorm/Reshape_1/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fully_connected/BatchNorm/Shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="fully_connected/BatchNorm/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="fully_connected/BatchNorm/Reshape_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="fully_connected/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="fully_connected/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" offset="5680844" shape="4" size="32"/>
			<output>
				<port id="0" names="Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape/Transpose/value43036190" type="Const" version="opset1">
			<data element_type="i64" offset="5680876" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Reshape/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="44786319" type="Const" version="opset1">
			<data element_type="i64" offset="5681932" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Tile" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Tile:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="2" names="concat:0" precision="FP32">
					<dim>1</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Conv_15/weights/read" type="Const" version="opset1">
			<data element_type="f32" offset="5681964" shape="71, 199, 1, 1" size="56516"/>
			<output>
				<port id="0" names="Conv_15/weights/read:0" precision="FP32">
					<dim>71</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_15/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>71</dim>
					<dim>199</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv_15/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_15/biases/read" type="Const" version="opset1">
			<data element_type="f32" offset="5738480" shape="1, 71, 1, 1" size="284"/>
			<output>
				<port id="0" names="Conv_15/biases/read:0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_15/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_331" type="Const" version="opset1">
			<data element_type="i64" offset="5738764" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Squeeze_332" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>1</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Squeeze:0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_335" type="Const" version="opset1">
			<data element_type="i64" offset="5738772" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>71</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="CTCGreedyDecoder/ctc_data_permute_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="5738796" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
